x = 5                     #변수 x = 정수형 5 선언  
y = 3                     #변수 y = 정수형 3 선언

z = 1.2                   #변수 z = 실수형 1.2 선언

print("1)", x+y+z)        #정수형 x,y와 실수형 z를 더한값 출력
print("2)", x-y-z)        #정수형 x에서 정수형 y와 실수형 z를 뺀값 출력
print("2)", (x-y)-z)      #정수형 x에서 정수형 y를 뺀값에서 실수형 z를 뺀값 출력
print("3)", x*y*z, "\n")  #정수형 x,y와 실수형 z를 곱한값 출력후 한줄 공백
print("4)", x%y%z)        #정수형 x를 정수형 y와 실수형 z으로 나눈값 출력
print("4)", (x%y)%z)      #정수형 x를 정수형 y로 나눈값을 실수형 z로 나눈값 출력


print("5)", x**y**z)      #\
print("5"), x**(y**z))    #ㅣx의 y제곱의 z제곱값 출력  
print("5)", (x**y)**z)    #/
print("6)", x**y)         #x의 y제곱값 출력